
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 8 to change, 6 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_activity_log_alert.main
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * azurerm_resource_group.rg
  * module.application_insights.azurerm_application_insights.this
  * module.et-key-vault.azurerm_key_vault.kv
  * module.servicebus-namespace-ret3725.azurerm_servicebus_namespace.servicebus_namespace
* Replace
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue.servicebus_queue
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.update-case-queue-ret3725.azurerm_servicebus_queue.servicebus_queue
  * module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://et-aat.vault.azure.net/secrets/app-insights-connection-string/f15cd6cfe9b44465b4fd8d6d193c529c"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id                      = "https://et-aat.vault.azure.net/secrets/create-updates-queue-listen-connection-string/a2a81e7df3de49a8ac860e071911c664"
        name                    = "create-updates-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id                      = "https://et-aat.vault.azure.net/secrets/create-updates-queue-send-connection-string/08db17356375499cb5e75bd04a1b348e"
        name                    = "create-updates-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id                      = "https://et-aat.vault.azure.net/secrets/update-case-queue-send-connection-string/e794c22d00d84a79ad3fbb61ef29b197"
        name                    = "update-case-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat"
        name       = "et-aat"
      ~ tags       = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (2 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> true
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.Insights/components/et-aat"
        name                                  = "et-aat"
      ~ tags                                  = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (14 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - et-aat"
      + resource_group_name = "et-aat"
      + scopes              = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.Insights/components/et-aat",
        ]
      + tags                = {
          + "application"         = "employment-tribunals"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-developers"
          + "environment"         = "staging"
          + "managedBy"           = "Employment Tribunals"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C05URPSN326"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.Insights/components/et-aat"
        }
    }

  # module.create-updates-queue-ret3725.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "et-sb-aat"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "et-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "create-updates"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat" # forces replacement -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.et-key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
        name                            = "et-aat"
      ~ tags                            = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.servicebus-namespace-ret3725.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat"
        name                                = "et-sb-aat"
      ~ tags                                = {
            "application"         = "employment-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.update-case-queue-ret3725.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "et-sb-aat"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "et-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "update-case"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat" # forces replacement -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-sb-aat/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 8 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":78,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->